# Series

ì‹œë¦¬ì¦ˆ : ì»¬ëŸ¼ + ì¸ë±ìŠ¤ í˜•ì‹ìœ¼ë¡œ ì €ì¥, ê´€ë¦¬ -> ë¦¬ìŠ¤íŠ¸/ë°°ì—´ê³¼ ìœ ì‚¬í•œ í˜•ì‹
* ì»¬ëŸ¼ : 1ì°¨ì› ë°ì´í„°ì˜ ëª¨ìŒ - 1ê°œì˜ ì»¬ëŸ¼  ,,, ì¸ë±ìŠ¤+ì»¬ëŸ¼ ì´ë ‡ê²Œ í•œê°œ,, ì—¬ëŸ¬ê°œë©´ ë°ì´í„°í”„ë ˆì„.
* ì»¬ëŸ¼ë“¤ -> ë°ì´í„°í”„ë ˆì„

ë°ì´í„°í”„ë ˆì„ : ì¸ë±ìŠ¤ + ì»¬ëŸ¼ë“¤ -> ì—‘ì…€ í‘œ(í…Œì´ë¸”)ì™€ ìœ ì‚¬í•œ í˜•íƒœ

In [2]:
import pandas as pd

In [5]:
s1 = pd.Series([10, 20, 30])
s1[0:2]

0    10
1    20
dtype: int64

In [8]:
col_idx = ['A', 'B', 'C']
data = [10,20,30]
s2 = pd.Series(data, index= col_idx)
s2 #íŒë‹¤ìŠ¤ ë°ì´í„° íƒ€ì…,, dtype

A    10
B    20
C    30
dtype: int64

In [24]:
s2

A    10
B    20
C    30
dtype: int64

In [16]:
s2['A']

np.int64(10)

In [ ]:
# ìŠ¬ë¼ì´ì‹± ì´ë¦„ê¸°ë°˜,, not ìœ„ì¹˜ê¸°ë°˜ ex) [0:3]
s2['A':'C'] #A~Cê¹Œì§€,,

A    10
B    20
C    30
dtype: int64

In [ ]:
# ë”•ì…”ë„ˆë¦¬ í‚¤ = ì‹œë¦¬ì¦ˆ ì¸ë±ìŠ¤
dict_data = {'A':10, 'B':20, 'C':30} 
type(dict_data)
s3 = pd.Series(dict_data)

In [20]:
s3

A    10
B    20
C    30
dtype: int64

In [4]:
dict_data = {'a':[1,2], 'b':[2,3], 'c':
  [3,4], 'd':[4,5]}
s3 = pd.Series(dict_data)
print(s3)

a    [1, 2]
b    [2, 3]
c    [3, 4]
d    [4, 5]
dtype: object

In [11]:
s3.info() #ê°ì²´ì˜ ë©”ì†Œë“œ

<class 'pandas.core.series.Series'>
Index: 4 entries, a to d
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      object
dtypes: object(1)
memory usage: 236.0+ bytes

In [12]:
population = pd.Series([9776, 2729, 1566, 3158], 
                    index=['ì„œìš¸', 'ë¶€ì‚°', 'ì¸ì²œ', 'ëŒ€êµ¬'])
population

ì„œìš¸    9776
ë¶€ì‚°    2729
ì¸ì²œ    1566
ëŒ€êµ¬    3158
dtype: int64

In [16]:
print (population['ì„œìš¸'])
print (population['ì„œìš¸'],population['ì¸ì²œ'])
print (population[['ì„œìš¸','ì¸ì²œ']])

9776
9776 1566
ì„œìš¸    9776
ì¸ì²œ    1566
dtype: int64

In [17]:
population['ì œì£¼'] = 20
population

ì„œìš¸    9776
ë¶€ì‚°    2729
ì¸ì²œ    1566
ëŒ€êµ¬    3158
ì œì£¼      20
dtype: int64

In [18]:
population['ì œì£¼'] = 1000
population

ì„œìš¸    9776
ë¶€ì‚°    2729
ì¸ì²œ    1566
ëŒ€êµ¬    3158
ì œì£¼    1000
dtype: int64

In [23]:
# ë¦¬ìŠ¤íŠ¸ë¡œ ë°ì´í„°í”„ë ˆì„ ìƒì„±
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

pd.DataFrame(data, columns=['A','B','C'], index=['ê°€','ë‚˜','ë‹¤'])

   A  B  C
ê°€  1  2  3
ë‚˜  4  5  6
ë‹¤  7  8  9

In [24]:
import numpy as np

In [26]:
# 2ì°¨ì› ë„˜íŒŒì´ ì–´ë ˆì´ ìƒì„±
arr = np.array([[1, 2, 3],
                [4, 5, 6],
                [7, 8, 9]])
arr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [27]:
pd.DataFrame(arr,index=['a','b','c'],columns=['A','B','C'])

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [30]:
# ì‹œë¦¬ì¦ˆ ìƒì„±
names = pd.Series(['ê¹€ì² ìˆ˜', 'ì´ì˜í¬', 'ë°•ë¯¼ìˆ˜'])
ages = pd.Series([25, 28, 22])
scores = pd.Series([85, 92, 78])
names, ages, scores

(0    ê¹€ì² ìˆ˜
 1    ì´ì˜í¬
 2    ë°•ë¯¼ìˆ˜
 dtype: object,
 0    25
 1    28
 2    22
 dtype: int64,
 0    85
 1    92
 2    78
 dtype: int64)

In [37]:
pd.DataFrame(data=[ages.values,scores.values],columns=names)

   ê¹€ì² ìˆ˜  ì´ì˜í¬  ë°•ë¯¼ìˆ˜
0   25   28   22
1   85   92   78

In [64]:
import pandas as pd

# ìƒ˜í”Œ ë°ì´í„°í”„ë ˆì„ ìƒì„±
data = {
    'ì´ë¦„': ['ê¹€ì² ìˆ˜', 'ì´ì˜í¬', 'ë°•ë¯¼ìˆ˜', 'ì •ìˆ˜ì§„', 'ìµœì˜í˜¸', 'í•œë¯¸ë˜', 'ìœ¤ì§€ì›'],
    'ë‚˜ì´': [25, 28, 22, 31, 27, 24, 29],
    'ì ìˆ˜': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

    ì´ë¦„  ë‚˜ì´  ì ìˆ˜
0  ê¹€ì² ìˆ˜  25  85
1  ì´ì˜í¬  28  92
2  ë°•ë¯¼ìˆ˜  22  78
3  ì •ìˆ˜ì§„  31  95
4  ìµœì˜í˜¸  27  88
5  í•œë¯¸ë˜  24  73
6  ìœ¤ì§€ì›  29  91

In [66]:
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']
df.columns = ['name', 'age', 'score']
df

  name  age  score
A  ê¹€ì² ìˆ˜   25     85
B  ì´ì˜í¬   28     92
C  ë°•ë¯¼ìˆ˜   22     78
D  ì •ìˆ˜ì§„   31     95
E  ìµœì˜í˜¸   27     88
F  í•œë¯¸ë˜   24     73
G  ìœ¤ì§€ì›   29     91

In [67]:
# inplaceë¥¼ Trueë¡œ ë„£ìœ¼ë©´ í•´ë‹¹ ê°’ì´ ë°”ë€œ,, FalseëŠ” ê·¸ëŒ€ë¡œ
# í•˜ì§€ë§Œ inplaceëŠ” ìœ„í—˜í•¨... ê·¸ëƒ¥ ìƒˆë¡œìš´ df_1ë¡œ ë³µì‚¬ë³¸ ë§Œë“¤ì–´ì„œ í™•ì¸í•˜ëŠ” ê²ƒì´ ì•ˆì „í•¨.
df_1 = df.rename(columns={'name':'ì´ë¦„'}) 
df_1

    ì´ë¦„  age  score
A  ê¹€ì² ìˆ˜   25     85
B  ì´ì˜í¬   28     92
C  ë°•ë¯¼ìˆ˜   22     78
D  ì •ìˆ˜ì§„   31     95
E  ìµœì˜í˜¸   27     88
F  í•œë¯¸ë˜   24     73
G  ìœ¤ì§€ì›   29     91

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, A to G
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   age     7 non-null      int64
 2   score   7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 524.0+ bytes

In [70]:
# ë””í´íŠ¸ëŠ” 5ê°œ
df.head(3)

  name  age  score
A  ê¹€ì² ìˆ˜   25     85
B  ì´ì˜í¬   28     92
C  ë°•ë¯¼ìˆ˜   22     78

In [71]:
df.describe()

             age      score
count   7.000000   7.000000
mean   26.571429  86.000000
std     3.101459   7.958224
min    22.000000  73.000000
25%    24.500000  81.500000
50%    27.000000  88.000000
75%    28.500000  91.500000
max    31.000000  95.000000

# ì¸ë±ì‹±

[] ì¸ë±ì‹±

- iloc[] í–‰ê¸°ë°˜ ì¸ë±ì‹± >> [í–‰,ì—´] , [ì¸ë±ìŠ¤, ì¹¼ëŸ¼] êµ¬ì¡°
- loc[] ì´ë¦„ê¸°ë°˜(ìœ„ì¹˜) ì¸ë±ì‹± >> [í–‰,ì—´], [ì¸ë±ìŠ¤,ì¹¼ëŸ¼] êµ¬ì¡°

- : >> start:endê¹Œì§€ ìŠ¬ë¼ì´ì‹±,, ë²”ìœ„ ì—†ìœ¼ë©´ ëê¹Œì§€(ì „ì²´)
- loc[í–‰ì´ë¦„:í–‰ì´ë¦„]
- iloc[í–‰ë²ˆí˜¸:í–‰ë²ˆí˜¸] >>> end í–‰ë²ˆí˜¸ëŠ” -1ê¹Œì§€

In [75]:
df_1

    ì´ë¦„  age  score
A  ê¹€ì² ìˆ˜   25     85
B  ì´ì˜í¬   28     92
C  ë°•ë¯¼ìˆ˜   22     78
D  ì •ìˆ˜ì§„   31     95
E  ìµœì˜í˜¸   27     88
F  í•œë¯¸ë˜   24     73
G  ìœ¤ì§€ì›   29     91

In [ ]:
df_1[['ì´ë¦„','age']]

In [84]:
#.loc['index','column]
df_1.loc[:,['ì´ë¦„','age']]

    ì´ë¦„  age
A  ê¹€ì² ìˆ˜   25
B  ì´ì˜í¬   28
C  ë°•ë¯¼ìˆ˜   22
D  ì •ìˆ˜ì§„   31
E  ìµœì˜í˜¸   27
F  í•œë¯¸ë˜   24
G  ìœ¤ì§€ì›   29

In [ ]:
# í–‰ ì¸ë±ìŠ¤ ê¸°ë°˜ ì¶”ì¶œ
df_1.loc['A']

ì´ë¦„       ê¹€ì² ìˆ˜
age       25
score     85
Name: A, dtype: object

In [87]:
# í–‰,ì—´ ë²ˆí˜¸ ê¸°ë°˜ ì¶”ì¶œ
df_1.iloc[0:3,0:2]

    ì´ë¦„  age
A  ê¹€ì² ìˆ˜   25
B  ì´ì˜í¬   28
C  ë°•ë¯¼ìˆ˜   22

# ì—°ìŠµë¬¸ì œ
[ê¸°ë³¸]

ëª¨ë“  í–‰ì—ì„œ ì´ë¦„ ì—´ë§Œ ì„ íƒí•˜ì„¸ìš”.

ëª¨ë“  í–‰ì—ì„œ ì´ë¦„ê³¼ score ì—´ì„ ì„ íƒí•˜ì„¸ìš”.

ì¸ë±ìŠ¤ C í–‰ì˜ ëª¨ë“  ë°ì´í„°ë¥¼ ì„ íƒí•˜ì„¸ìš”.

ì¸ë±ìŠ¤ D í–‰ì˜ age ê°’ë§Œ ì„ íƒí•˜ì„¸ìš”.

In [88]:
df

  name  age  score
A  ê¹€ì² ìˆ˜   25     85
B  ì´ì˜í¬   28     92
C  ë°•ë¯¼ìˆ˜   22     78
D  ì •ìˆ˜ì§„   31     95
E  ìµœì˜í˜¸   27     88
F  í•œë¯¸ë˜   24     73
G  ìœ¤ì§€ì›   29     91

In [90]:
df.loc[:,'name']

A    ê¹€ì² ìˆ˜
B    ì´ì˜í¬
C    ë°•ë¯¼ìˆ˜
D    ì •ìˆ˜ì§„
E    ìµœì˜í˜¸
F    í•œë¯¸ë˜
G    ìœ¤ì§€ì›
Name: name, dtype: object

In [95]:
df.iloc[:,0::2]

  name  score
A  ê¹€ì² ìˆ˜     85
B  ì´ì˜í¬     92
C  ë°•ë¯¼ìˆ˜     78
D  ì •ìˆ˜ì§„     95
E  ìµœì˜í˜¸     88
F  í•œë¯¸ë˜     73
G  ìœ¤ì§€ì›     91

In [99]:
df.loc['C']

name     ë°•ë¯¼ìˆ˜
age       22
score     78
Name: C, dtype: object

In [102]:
print(df.loc['D','age'])

31

[ìŠ¬ë¼ì´ì‹±]

ì¸ë±ìŠ¤ Bë¶€í„° Eê¹Œì§€ì˜ ëª¨ë“  í–‰ì„ ì„ íƒí•˜ì„¸ìš”.

ì¸ë±ìŠ¤ Cë¶€í„° Fê¹Œì§€ì˜ ì´ë¦„ê³¼ age ì—´ë§Œ ì„ íƒí•˜ì„¸ìš”.

ì¸ë±ìŠ¤ Aë¶€í„° Gê¹Œì§€ì—ì„œ score ì—´ë§Œ ì„ íƒí•˜ì„¸ìš”.

In [104]:
df.loc['B':'E']

  name  age  score
B  ì´ì˜í¬   28     92
C  ë°•ë¯¼ìˆ˜   22     78
D  ì •ìˆ˜ì§„   31     95
E  ìµœì˜í˜¸   27     88

In [107]:
df.loc['C':'F','name':'age']

  name  age
C  ë°•ë¯¼ìˆ˜   22
D  ì •ìˆ˜ì§„   31
E  ìµœì˜í˜¸   27
F  í•œë¯¸ë˜   24

In [109]:
df.loc['A':'G','score']

A    85
B    92
C    78
D    95
E    88
F    73
G    91
Name: score, dtype: int64

[ì¡°ê±´ + loc]

ageê°€ 27 ì´ìƒì¸ í–‰ë§Œ ì„ íƒí•˜ì„¸ìš”.

scoreê°€ 90 ì´ìƒì¸ ì‚¬ëŒì˜ ì´ë¦„ê³¼ scoreë§Œ ì¶œë ¥í•˜ì„¸ìš”.

ageê°€ 25 ì´ìƒì´ë©´ì„œ scoreê°€ 90 ì´ìƒì¸ í–‰ì„ ëª¨ë‘ ì„ íƒí•˜ì„¸ìš”.

iloc ì¸ë±ì‹± & ìŠ¬ë¼ì´ì‹± ì—°ìŠµë¬¸ì œ

ğŸ‘‰ ì •ìˆ˜ ìœ„ì¹˜ ê¸°ë°˜ (0ë¶€í„° ì‹œì‘)

# boolean ì¸ë±ì‹±

In [ ]:
# vectorization
df['score'] > 90

A    False
B     True
C    False
D     True
E    False
F    False
G     True
Name: score, dtype: bool

In [121]:
# boolean listì˜ ìš”ì†Œê°’ True, Falseë¡œ ë¹„êµ
df [ df['score'] > 90]

  name  age  score
B  ì´ì˜í¬   28     92
D  ì •ìˆ˜ì§„   31     95
G  ìœ¤ì§€ì›   29     91

In [122]:
print (df.loc[df['age']>= 27])
print (df[df['age']>=27])

  name  age  score
B  ì´ì˜í¬   28     92
D  ì •ìˆ˜ì§„   31     95
E  ìµœì˜í˜¸   27     88
G  ìœ¤ì§€ì›   29     91
  name  age  score
B  ì´ì˜í¬   28     92
D  ì •ìˆ˜ì§„   31     95
E  ìµœì˜í˜¸   27     88
G  ìœ¤ì§€ì›   29     91

In [126]:
print (df.loc[df['score']>=90,'name'::2])
print (df.loc[df['score']>=90,['name','score']])

  name  score
B  ì´ì˜í¬     92
D  ì •ìˆ˜ì§„     95
G  ìœ¤ì§€ì›     91
  name  score
B  ì´ì˜í¬     92
D  ì •ìˆ˜ì§„     95
G  ìœ¤ì§€ì›     91

In [132]:
df.loc[(df['age']>=25) & (df['score']>= 90)]

  name  age  score
B  ì´ì˜í¬   28     92
D  ì •ìˆ˜ì§„   31     95
G  ìœ¤ì§€ì›   29     91

[ê¸°ë³¸]

ì²« ë²ˆì§¸ í–‰ì˜ ëª¨ë“  ë°ì´í„°ë¥¼ ì„ íƒí•˜ì„¸ìš”.

ì„¸ ë²ˆì§¸ í–‰ì˜ ì´ë¦„ ê°’ë§Œ ì„ íƒí•˜ì„¸ìš”.

ì²˜ìŒ 3ê°œì˜ í–‰ì„ ì„ íƒí•˜ì„¸ìš”.

ë§ˆì§€ë§‰ í–‰ì˜ score ê°’ë§Œ ì„ íƒí•˜ì„¸ìš”.

In [133]:
df.iloc[0]

name     ê¹€ì² ìˆ˜
age       25
score     85
Name: A, dtype: object

In [138]:
df.iloc[:3]

  name  age  score
A  ê¹€ì² ìˆ˜   25     85
B  ì´ì˜í¬   28     92
C  ë°•ë¯¼ìˆ˜   22     78

In [139]:
print(df.iloc[-1,2])

91

[ìŠ¬ë¼ì´ì‹±]

1ë²ˆ í–‰ë¶€í„° 4ë²ˆ í–‰ê¹Œì§€ ì„ íƒí•˜ì„¸ìš”.

2ë²ˆ í–‰ë¶€í„° 5ë²ˆ í–‰ê¹Œì§€ì—ì„œ ì´ë¦„ê³¼ age ì—´ë§Œ ì„ íƒí•˜ì„¸ìš”.

ëª¨ë“  í–‰ì—ì„œ age ì—´ë§Œ ì„ íƒí•˜ì„¸ìš”.

In [140]:
df.iloc[0:4]

  name  age  score
A  ê¹€ì² ìˆ˜   25     85
B  ì´ì˜í¬   28     92
C  ë°•ë¯¼ìˆ˜   22     78
D  ì •ìˆ˜ì§„   31     95

In [143]:
df.iloc[1:5,:2]

  name  age
B  ì´ì˜í¬   28
C  ë°•ë¯¼ìˆ˜   22
D  ì •ìˆ˜ì§„   31
E  ìµœì˜í˜¸   27

In [147]:
df.iloc[:,1:2]

   age
A   25
B   28
C   22
D   31
E   27
F   24
G   29

[ì¡°í•© ë¬¸ì œ]

score ì—´ë§Œ ì„ íƒí•˜ë˜, ì•ì—ì„œ 4ê°œì˜ í–‰ë§Œ ì¶œë ¥í•˜ì„¸ìš”.

ì´ë¦„ê³¼ score ì—´ì„ ì„ íƒí•˜ë˜, ë§ˆì§€ë§‰ 3ê°œì˜ í–‰ë§Œ ì¶œë ¥í•˜ì„¸ìš”.

ì§ìˆ˜ ë²ˆì§¸ í–‰(0, 2, 4, 6)ì˜ ëª¨ë“  ë°ì´í„°ë¥¼ ì„ íƒí•˜ì„¸ìš”.

In [150]:
df

  name  age  score
A  ê¹€ì² ìˆ˜   25     85
B  ì´ì˜í¬   28     92
C  ë°•ë¯¼ìˆ˜   22     78
D  ì •ìˆ˜ì§„   31     95
E  ìµœì˜í˜¸   27     88
F  í•œë¯¸ë˜   24     73
G  ìœ¤ì§€ì›   29     91

In [158]:
df.iloc[:4,2:]

   score
A     85
B     92
C     78
D     95

In [ ]:
df.iloc[-3:,::2]
# df.iloc[-3:,[0,2]]

  name  score
E  ìµœì˜í˜¸     88
F  í•œë¯¸ë˜     73
G  ìœ¤ì§€ì›     91

In [153]:
df.iloc[::2]

  name  age  score
A  ê¹€ì² ìˆ˜   25     85
C  ë°•ë¯¼ìˆ˜   22     78
E  ìµœì˜í˜¸   27     88
G  ìœ¤ì§€ì›   29     91

In [165]:
df.loc['H'] = ['ì¥ë¯¼í˜¸', 26, 88]
df

  name  age  score
A  ê¹€ì² ìˆ˜   25     85
B  ì´ì˜í¬   28     92
C  ë°•ë¯¼ìˆ˜   22     78
D  ì •ìˆ˜ì§„   31     95
E  ìµœì˜í˜¸   27     88
F  í•œë¯¸ë˜   24     73
G  ìœ¤ì§€ì›   29     91
H  ì¥ë¯¼í˜¸   26     88

In [168]:
df['grade'] = ['A', 'B', 'A', 'A', 'B', 'C', 'A','B']
df

  name  age  score grade
A  ê¹€ì² ìˆ˜   25     85     A
B  ì´ì˜í¬   28     92     B
C  ë°•ë¯¼ìˆ˜   22     78     A
D  ì •ìˆ˜ì§„   31     95     A
E  ìµœì˜í˜¸   27     88     B
F  í•œë¯¸ë˜   24     73     C
G  ìœ¤ì§€ì›   29     91     A
H  ì¥ë¯¼í˜¸   26     88     B

In [170]:
df.insert(loc=1, column='student_id', value=['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007','S008'])
df

  name student_id  age  score grade
A  ê¹€ì² ìˆ˜       S001   25     85     A
B  ì´ì˜í¬       S002   28     92     B
C  ë°•ë¯¼ìˆ˜       S003   22     78     A
D  ì •ìˆ˜ì§„       S004   31     95     A
E  ìµœì˜í˜¸       S005   27     88     B
F  í•œë¯¸ë˜       S006   24     73     C
G  ìœ¤ì§€ì›       S007   29     91     A
H  ì¥ë¯¼í˜¸       S008   26     88     B